In [1]:
# need to install pandas - "conda install pandas"

In [14]:
import numpy as np

In [15]:
import pandas as pd

In [4]:
ids = ['a', 'b', 'c'] # id list
data = [10, 20, 30]   # data list
arr = np.array(data)  # numpy data array
dic = {'a':10, 'b':20, 'c':30} # dictionary

In [5]:
pd.Series(data)

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(data, ids) # can set actual name shown from shift+tab to clearify pd.Series(data=data, index=ids) if out of order

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(arr) # can take multiple formats and convert them, numpy array here, dictionary example below

0    10
1    20
2    30
dtype: int64

In [11]:
pd.Series(dic)

a    10
b    20
c    30
dtype: int64

In [15]:
series = pd.Series(['CAN', 'USA', 'MEX', 'UK', 'RU'], [1, 2, 3, 4, 5])

In [19]:
series # notice dtype is object for the strings

1    CAN
2    USA
3    MEX
4     UK
5     RU
dtype: object

In [20]:
series[1] # pulling by label - NOT by index

'CAN'

In [21]:
series_two = pd.Series(['CAN', 'USA', 'WUT', 'UK', 'RU'], [1, 2, 6, 4, 5])

In [23]:
series + series_two # concat (add nums) or NaN if nothing to combine

1    CANCAN
2    USAUSA
3       NaN
4      UKUK
5      RURU
6       NaN
dtype: object

In [1]:
# DATA Frames # a bunch of series, that share an index

In [17]:
from numpy.random import randn

In [16]:
np.random.seed(101) # so that random numbers always generate the same

In [17]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W','X','Y','Z']) # data, index, columns categories passed

In [23]:
df  # I had it change, until I re-ran? odd, wish i would have saved the output...

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [24]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [27]:
type(df['W'])

pandas.core.series.Series

In [28]:
type(df)

pandas.core.frame.DataFrame

In [32]:
df.W # another way to format, not recommended as it could be confused between a methods on df and a named column ("keys" for example)

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [34]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [35]:
df['WYSUM'] = df['W'] + df['Y'] # create new column wysum which is the sum of column w and y

In [36]:
df

          W         X         Y         Z     WYSUM
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [42]:
df.drop('WYSUM', axis = 1) # will error on axis, arg2 is 0 for x and 1 for y, arg3 inplace=True (if you want to lock changes)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
df

          W         X         Y         Z     WYSUM
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [44]:
df.shape

(5, 5)

In [45]:
# selecting rows

In [50]:
df.loc['A'] # as the columns are a pandas "series", so are the rows - pull by labels

W        2.706850
X        0.628133
Y        0.907969
Z        0.503826
WYSUM    3.614819
Name: A, dtype: float64

In [51]:
df.iloc[2] # by numerical index

W       -2.018168
X        0.740122
Y        0.528813
Z       -0.589001
WYSUM   -1.489355
Name: C, dtype: float64

In [53]:
df.loc['B', 'Y'] # single

-0.84807698340363147

In [56]:
df.loc[['A', 'B'], ['W', 'Y']] # snag sections

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [57]:
df.drop('WYSUM', axis = 1, inplace = True)

In [58]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [59]:
# conditional statements on data frames

In [69]:
df > 0 # similar to comparision the numpy array

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [61]:
booldf = df > 0

In [63]:
df[booldf] # use a conditional against a data frame

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [65]:
df[df > 0] # can also directly dump in as per usual

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [70]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [71]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [75]:
df[df['W'] > 0] # yank ROW C because < 0 | passing it this way you'll get the proper series back - not the NaN **

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [77]:
df[df['Z'] < 0] # only pull me the row meeting this condition

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [78]:
resultsdf = df[df['W'] > 0]

In [80]:
resultsdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [89]:
df[df['W'] > 0]['X'] # same as previous in a single liner **

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [90]:
df[df['W'] > 0][['X','Y']] # with multiple fields

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [94]:
boolser = df['W'] > 0 # try and break it down to understand the one liner above
mycols = ['Y', 'X']
result = df[boolser]
result[mycols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [99]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [102]:
df[(df['W'] > 0) & (df['Y'] > 1)] # tempted to do "and" but needs to be & for comparison (ambiguity) "or" is | ** for TWIN

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [104]:
df.reset_index() # again, needs inplace to save, old index just becomes a column you could toss

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [111]:
newind = 'CA NY WY OR CO'.split() # nice quick way to populate

In [106]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [107]:
df['States'] = newind

In [108]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [110]:
df.set_index('States') # will actually override old index, needs inplace again of course

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [22]:

# Multi index and Index Hierarchy

In [6]:
# Index Levels
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 1, 2, 3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [10]:
list(zip(outside, inside)) # create a list of tuples from given list variables - maybe should introduce earlier?

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [12]:
hier_index # interesting

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [26]:
pd.DataFrame(randn(6, 2), hier_index, ['A', 'B']) # this makes more sense | notice no column (index) name for C0 or C1

             A         B
G1 1 -1.368432 -0.316633
   2  0.113257 -1.012904
   3 -0.653492 -2.451303
G2 1  0.105124 -1.264839
   2  1.085175  0.054368
   3  0.991670  0.033003

In [27]:
df = pd.DataFrame(randn(6, 2), hier_index, ['A', 'B'])

In [28]:
df.loc['G1']

          A         B
1  0.963951 -1.397899
2 -1.715300 -0.731170
3 -0.601877 -0.953631

In [30]:
df.index.names # nested indexs c0 and c1 dont have names so...

FrozenList([None, None])

In [33]:
df.index.names = ['Groups', 'Numbers'] # add em in

In [32]:
df

                       A         B
Groups Numbers
G1     1        0.963951 -1.397899
       2       -1.715300 -0.731170
       3       -0.601877 -0.953631
G2     1       -1.425005 -1.219794
       2        1.308045  0.024999
       3       -1.155494  1.861484

In [34]:
df.loc['G2']

                A         B
Numbers
1       -1.425005 -1.219794
2        1.308045  0.024999
3       -1.155494  1.861484

In [36]:
df.loc['G2'].loc[2]['B'] # pull out 2nd row, B value

0.024999248663786555

In [40]:
df

                       A         B
Groups Numbers
G1     1        0.963951 -1.397899
       2       -1.715300 -0.731170
       3       -0.601877 -0.953631
G2     1       -1.425005 -1.219794
       2        1.308045  0.024999
       3       -1.155494  1.861484

In [37]:
df.xs('G1') # cross section

                A         B
Numbers
1        0.963951 -1.397899
2       -1.715300 -0.731170
3       -0.601877 -0.953631

In [39]:
df.xs(1, level='Numbers') # pull the first w

               A         B
Groups
G1      0.963951 -1.397899
G2     -1.425005 -1.219794